[
  {
    "id": "mk9t1qnhu1suxj6t5bm",
    "slug": "slayder",
    "type": "component",
    "title": "Слайдер",
    "description": " ",
    "date": "2026-01-10",
    "category": "vibecode",
    "coverImage": "/images/cases/1768659658711-7f7wk6.png",
    "images": [],
    "componentUrl": "/Elements/text show/index.html",
    "tags": [
      "test"
    ],
    "content": "test slider",
    "published": true,
    "featuredOnHome": false,
    "homeOrder": null,
    "createdAt": "2026-01-11T14:04:02.477Z",
    "updatedAt": "2026-01-20T13:07:52.849Z",
    "galleryLayout": "stack",
    "title_en": "Slider",
    "description_en": ""
  },
  {
    "id": "mk9tmbkk8rtaei411o",
    "slug": "ios-app-dlya-igrovogo-kluba",
    "type": "gallery",
    "title": "IOS APP для игрового клуба",
    "description": "Продукт: THE HOOD (App для кибер-клуба) | Роль: Product Designer | Цель: Цифровизация оффлайн-бизнеса и создание бесшовного O2O (Online-to-Offline) опыта | Статус: Релиз МВП\n## Проблема\nКрупнейший кибер-клуб Астаны столкнулся с ограничениями масштабирования из-за разрыва между цифровым и физическим опытом клиента:\n1. **Фрагментарный сервис:** Бронирование, оплата и вход в клуб существовали в разных плоскостях, создавая высокий порог входа для новых пользователей.\n2. **Сложность биллинга:** Существующая модель оплаты требовала сложных транзакций и разных счетов, что снижало конверсию в покупку пакетов.\n3. **Отсутствие LTV-инструментов:** Не было механик для удержания пользователей и возврата их в клуб **(retention)**.\n## Цели\nСоздать единую цифровую экосистему **(Mobile App + ERP)**, интегрированную в **Service Blueprint** бизнеса. \n- **Финансовая модель:** Внедрение единой внутриклубной валюты («Кидалкоины») для устранения трения при оплате и унификации счетов. \n- **Сервисный дизайн:** Проектирование сквозного пути пользователя: от бронирования дома до посадки за компьютер в клубе. \n- **Архитектура:** Синхронизация данных между Mobile App (клиент) и ERP (менеджмент) в реальном времени.\n## Ключевые метрики\nУспех оценивался через рост % онлайн-бронирований (снижение нагрузки на ресепшн), увеличение ARPU (средний чек) за счет пакетных предложений и время сессии (Time spent).\n## Процесс работы\nРабота строилась как полноценный продуктовый цикл в сжатые сроки студийной разработки:\n1. **Ресерч и дискавери:** Составили карту сервиса, чтобы понять, в каких точках Mobile App должен взаимодействовать с ERP и физическим оборудованием клуба.\n2. **UI дизайн:** Разработана масштабируемая дизайн-система, учитывающая темную тему (Dark Mode first) как стандарт индустрии и специфику освещения в клубе.\n3. **Улучшение UX:** Спроектирован флоу покупки и использования внутренней валюты. Это решило техническую боль «разных счетов» и заложило фундамент для геймификации.\n4. **Синк между платформами:** Параллельное проектирование ERP и App для обеспечения консистентности данных (пользователь видит то же, что и админ).\n## Риск менеджмент\n- **Риск:** Сложная верификация и сбор данных отпугнут пользователей. Митигация: Внедрен «отложенный KYC». Пользователь попадает в приложение сразу, а полные данные запрашиваются только в момент бронирования/оплаты. \n- **Риск:** Пользователи не поймут систему внутренней валюты. Митигация: Прозрачный калькулятор конвертации и визуализация баланса на главном экране.\n## Итоги\nЗапущен MVP экосистемы, трансформировавший традиционный игровой клуб в технологичный подход. \n- **Общий UX:** Единый профиль пользователя для App и ERP. \n- **Польза для бизнеса:** Внедрение внутренней валюты упростило финансовые потоки и создало базу для будущей программы лояльности. \n- **Дизайн с учетом на будущее:** Архитектура приложения готова к внедрению турнирных механик и стриминговых сервисов (следующий шаг для бизнеса).",
    "date": "2026-01-11",
    "category": "design",
    "coverImage": "/images/cases/1768248153349-vozwes.png",
    "images": [
      "/images/cases/1768249250463-tfykig.png",
      "/images/cases/1768249250517-k4c4mt.png",
      "/images/cases/1768249250522-i3eyke.png",
      "/images/cases/1768249250532-jcwbdo.png",
      "/images/cases/1768249250537-1ff55y.png",
      "/images/cases/1768249250543-nexys7.png",
      "/images/cases/1768249250595-zps8bw.png",
      "/images/cases/1768249250601-8ov7t1.png",
      "/images/cases/1768249250616-lyzzhy.png",
      "/images/cases/1768249250617-580v56.png",
      "/images/cases/1768249250657-ycg9m7.png",
      "/images/cases/1768249250663-13p0e2.png",
      "/images/cases/1768249250680-0jtyz6.png",
      "/images/cases/1768249250680-p6mvli.png"
    ],
    "componentUrl": "",
    "tags": [
      "IOS APP",
      "B2C"
    ],
    "content": "test",
    "published": true,
    "featuredOnHome": true,
    "homeOrder": 3,
    "createdAt": "2026-01-11T14:20:02.708Z",
    "updatedAt": "2026-01-20T13:07:52.849Z",
    "galleryLayout": "masonry",
    "title_en": "IOS APP for Game club ",
    "description_en": "Product: THE HOOD (Cyber Club Superapp) | Role: Lead Product Designer (Studio) Goal: Digitalization of an offline business and creating a seamless O2O (Online-to-Offline) experience | Status: Release (MVP)\n## Problem\nAstana’s largest cyber club faced scaling limitations due to a disconnect between the digital and physical customer experience:\n1. Fragmented Service: Booking, payment, and club entry existed in separate planes, creating a high entry barrier for new users.\n2. Billing Complexity: The existing payment model required complex transactions and multiple accounts, which reduced conversion into package purchases.\n3. Lack of LTV Tools: There were no mechanics to retain users and return them to the club (retention).\n## Goals\nCreate a unified digital ecosystem (Mobile App + ERP), integrated into the business Service Blueprint.\n- **Financial Model:** Implementation of a unified in-club currency (\"Kidalloins\") to eliminate payment friction and unify accounts.\n- **Service Design:** Engineering an end-to-end user journey: from booking at home to sitting at a computer in the club.\n- **Architecture:** Real-time data synchronization between the Mobile App (client) and ERP (management).\n## Key Metrics\nSuccess was evaluated through the growth of % online bookings (reducing load on reception), increased ARPU (average check) via package offers, and session time (Time spent).\n## Work Process\nWork was structured as a full product cycle within tight studio development deadlines:\n1. **Discovery & Blueprint:** Mapped the service to understand at which points the Mobile App needs to interact with the ERP and physical club hardware.\n2. **System Design:** Developed a scalable design system considering dark mode (Dark Mode first) as an industry standard and the specific lighting in the club.\n3. **Economy UX:** Designed the flow for purchasing and using internal currency. This solved the technical pain of “different accounts” and laid the foundation for gamification.\n4. **Cross-platform Sync:** Parallel design of ERP and App to ensure data consistency (the user sees the same thing as the admin).\n## Risk Management\n- **Risk:** Complex verification and data collection might scare off users. Mitigation: Implemented “Deferred KYC”. The user enters the app immediately, and full data is requested only at the moment of booking/payment.\n- **Risk:** Users might not understand the internal currency system. Mitigation: Transparent conversion calculator and balance visualization on the main screen.\n## Results\nLaunched the ecosystem MVP, transforming a traditional gaming club into a Tech-driven business.\n- **Unified Experience:** Single user profile for App and ERP.\n- **Business Impact:** Implementation of internal currency simplified financial flows and created a base for a future loyalty program.\n- **Scalability:** App architecture is ready for the implementation of tournament mechanics and streaming services (Next Steps)."
  },
  {
    "id": "mk9uetxnue3k2wwpk3",
    "slug": "web-app-dlya-top-menedzherov",
    "type": "gallery",
    "title": "Web APP для топ-менеджеров",
    "description": "Продукт: ПОТОК (Agile-инструмент Сбера) | Роль: Staff Product Designer Цель: Унификация UX и сокращение Time-to-Market | Статус: Release & Scale\n## Проблема\nПродукт вырос из дополнения в самостоятельный инструмент, но развивался фрагментарно. Это привело к трем критическим барьерам:\n1. **UX/Дизайн долг:** Отсутствие единой логики делало интерфейс сложным для обучения и работы.\n2. **Архитектурный тупик:** Текущая структура не позволяла внедрить новый критичный слой — «Проекты».\n3. **Медленная разработка:** Отсутствие Дизайн-системы (DS) тормозило вывод новых фич (Time-to-Market).\n## Цели\nПроведен полный редизайн продукта с переходом на промышленную дизайн-систему.\n- **Информационная архитектура:** Внедрена новая иерархия (Цели банка → Проекты → Задачи → Заметки). Связаны разорванные модули.\n- **Дизайн-система:** Миграция на ANT Design System. Это унифицировало UI и ускорило верстку.\n- **Новые домены:** Создан фундамент для сущности «Проекты» и AI-ассистента (автопротоколы встреч, саммари).\n- **Процесс:** Инкрементальный редизайн параллельно с продуктовой разработкой (поддержка старой и новой версии UI).\n## Ключевые метрики\nМы оценивали успех через удовлетворенность пользователей и качественную валидацию от топ-менеджмента.\n## Процесс работы\nЧтобы не останавливать развитие продукта, внедрение шло в 4 этапа:\n1. **Фундамент:** Обновление навигации и структуры контента (Сайдбар).\n2. **Система:** Внедрение токенов и стилей ANT ДС.\n3. **Масшатбируемость:** Внедрение функционала «Проекты».\n4. **UX последовательность:** Последовательное обновление модулей (Задачи, Заметки) и устранение долга.\n## Риск менеджмент\n- **Риск:** Сопротивление изменениям со стороны консервативных пользователей. Митигация: Провели серию UX-интервью до релиза и быстрые циклы сбора ОС после.\n- **Риск:** Рассинхрон с параллельной разработкой фич. Митигация: Регулярная синхронизация плана редизайна с бэклогом фич, чтобы новые фичи сразу делались на новых компонентах.\n## Итоги\n«ПОТОК» трансформировался из разрозненного набора модулей в единую платформу для продуктивности Agile-команд.\n- Заложен фундамент для AI-ассистента.\n- Обеспечена масштабируемость (слой «Проекты»).\n- Единый UI/UX код во всех модулях.",
    "date": "2026-01-11",
    "category": "design",
    "coverImage": "/images/cases/1768245632342-6iywil.png",
    "images": [
      "/images/cases/1768425221673-7d0kog.png",
      "/images/cases/1768425221673-0wq8u8.png",
      "/images/cases/1768425221680-espfxz.png",
      "/images/cases/1768425221683-bgz2p9.png",
      "/images/cases/1768425221704-hbdyf8.png",
      "/images/cases/1768425221737-ctpncz.png",
      "/images/cases/1768425221707-ft2kp5.png",
      "/images/cases/1768425221739-duf77q.png",
      "/images/cases/1768425221739-csy2nl.png",
      "/images/cases/1768425221740-viaf6y.png",
      "/images/cases/1768425221750-l9paa7.png"
    ],
    "componentUrl": "",
    "tags": [
      "Web",
      "B2C/B2E"
    ],
    "content": "",
    "published": true,
    "featuredOnHome": true,
    "homeOrder": 1,
    "createdAt": "2026-01-11T14:42:12.875Z",
    "updatedAt": "2026-01-20T13:07:52.849Z",
    "galleryLayout": "stack",
    "title_en": "Web APP for Top-Managers ",
    "description_en": "Product: POTOK (Sber’s Agile tool) | Role: Staff Product Designer Goal: UX Unification and reducing Time-to-Market | Status: Release & Scale\n## Problem\nThe product evolved from an add-on into a standalone tool, but it developed in a fragmented way. This led to three critical barriers:\n1. UX/Design Debt: The lack of a unified logic made the interface difficult to learn and operate.\n2. Architectural Dead End: The existing structure did not allow for the implementation of a critical new layer — \"Projects.\"\n3. Slow Development: The absence of a Design System (DS) slowed down the release of new features (Time-to-Market).\n## Goals\nConducted a full product redesign with a transition to an enterprise-grade design system.\n- Information Architecture: Implemented a new hierarchy (Bank Goals → Projects → Tasks → Notes). Connected previously disconnected modules.\n- Design System: Migration to the ANT Design System. This unified the UI and accelerated frontend development.\n- New Domains: Created the foundation for the \"Projects\" entity and the AI Assistant (automated meeting minutes, summaries).\n- Process: Incremental redesign ran parallel to product development (supporting both the old and new UI versions).\n## Key Metrics\nWe evaluated success through user satisfaction and qualitative validation from top management.\n## Timeline & Scope\nTo avoid halting product evolution, implementation was carried out in 4 stages:\n1. Foundation: Updating navigation and content structure (Sidebar).\n2. System: Implementing ANT Design System tokens and styles.\n3. Scale: Implementing the \"Projects\" layer (scalability).\n4. UX Polish: Sequential updates of modules (Tasks, Notes) and debt elimination.\n## Risks\n- Risk: Resistance to change from conservative users. Mitigation: Conducted a series of UX interviews prior to release and utilized rapid feedback loops post-release.\n- Risk: Misalignment with parallel feature development. Mitigation: Regular synchronization of the redesign plan with the feature backlog to ensure new features were built immediately using new components.\n## Outcome\n\"POTOK\" transformed from a scattered set of modules into a unified productivity platform for Agile teams.\n- Laid the foundation for the AI Assistant.\n- Ensured scalability (via the \"Projects\" layer).\n- Established a unified UI/UX code base across all modules."
  },
  {
    "id": "mka0saqg9dksvu4qxmc",
    "slug": "grafik-s-kursorom",
    "type": "component",
    "title": "График с курсором",
    "description": " ",
    "date": "2026-01-11",
    "category": "vibecode",
    "coverImage": "/images/cases/1768659579828-ex311s.png",
    "images": [],
    "componentUrl": "/Elements/Slider/standalone_preview.html",
    "tags": [],
    "content": "",
    "published": false,
    "featuredOnHome": false,
    "homeOrder": null,
    "createdAt": "2026-01-11T17:40:38.872Z",
    "updatedAt": "2026-01-17T22:18:15.768Z",
    "galleryLayout": "stack",
    "title_en": "Graph cursor",
    "description_en": ""
  },
  {
    "id": "mkb6qlltgq9abjbichq",
    "slug": "ios-app-dlya-fitnesa",
    "type": "gallery",
    "title": "IOS APP для фитнеса",
    "description": "Скоро тут будет описание кейса! Пока в работе...",
    "date": "2026-01-12",
    "category": "design",
    "coverImage": "/images/cases/1768249470031-7esw3g.png",
    "images": [
      "/images/cases/1768248645890-omvmde.png",
      "/images/cases/1768248645891-umo751.png",
      "/images/cases/1768248645918-dqdnwx.png",
      "/images/cases/1768248645898-qgzjsl.png",
      "/images/cases/1768248645900-7c2ztg.png",
      "/images/cases/1768496957274-10cx3n.png",
      "/images/cases/1768248645901-064po2.png",
      "/images/cases/1768248645898-j7egu9.png",
      "/images/cases/1768496957272-373s4d.png",
      "/images/cases/1768496957275-rocu0g.png"
    ],
    "galleryLayout": "masonry",
    "componentUrl": "",
    "tags": [
      "IOS APP",
      "B2C"
    ],
    "content": "",
    "published": true,
    "featuredOnHome": true,
    "homeOrder": 2,
    "createdAt": "2026-01-12T13:15:03.521Z",
    "updatedAt": "2026-01-20T13:07:52.849Z",
    "title_en": "APP for Fitness Emotion",
    "description_en": "A case study will be posted here soon! It's still in development..."
  },
  {
    "id": "mkbmbxy1ltw6szmy33",
    "slug": "wms-modul-skladov",
    "type": "gallery",
    "title": "WMS модуль складов",
    "description": "Скоро тут будет описание кейса! Пока в работе... ",
    "date": "2026-01-12",
    "category": "design",
    "coverImage": "/images/cases/1768249881758-ccjxdn.png",
    "images": [
      "/images/cases/1768425483279-5ozlb8.png",
      "/images/cases/1768425483284-32m37x.png",
      "/images/cases/1768425483289-qtoa21.png",
      "/images/cases/1768425483300-ak3ze6.png",
      "/images/cases/1768425483301-dvij9u.png",
      "/images/cases/1768425483306-7unre9.png",
      "/images/cases/1768425483325-g9u5rk.png"
    ],
    "galleryLayout": "stack",
    "componentUrl": "",
    "tags": [
      "WMS",
      "B2E"
    ],
    "content": "",
    "published": true,
    "featuredOnHome": false,
    "homeOrder": null,
    "createdAt": "2026-01-12T20:31:33.529Z",
    "updatedAt": "2026-01-20T13:07:52.849Z",
    "title_en": "WMS for Armada",
    "description_en": "A case study will be posted here soon! It's still in development..."
  },
  {
    "id": "mkejkh4k9ahs3yeqhrm",
    "slug": "erp-dlya-igrovogo-kluba",
    "type": "gallery",
    "title": "ERP для игрового клуба",
    "description": "Продукт: THE HOOD OS (ПО на ПК + Админка) | Роль: Product Designer Цель: Автоматизация операционки и предложка услуг через десктоп | Статус: Релиз МВП\n## Проблема\nКлассическая модель работы компьютерного клуба создавала \"бутылочное горлышко\" на стойке регистрации.\n1. **Операционная нагрузка:** Администраторы тратили 80% времени на ручное продление времени и принятие заказов (еда/напитки), создавая очереди.\n2. **Разрыв опыта:** Геймеру приходилось вставать из-за ПК, чтобы докупить время или еду, что прерывало движение потока клиентов и снижало выручку.\n3. **Сложный онбординг:** Низкая конверсия в регистрацию из-за долгого заполнения форм на кассе.\n## Цели\nТрансформация \"компьютера для игр\" в \"терминал самообслуживания\". \n- **Автоматизация с помощью ПО:** Перенос 90% операций (продление, покупка еды, вызов помощи) внутрь клиентского интерфейса на ПК. \n- **Кроссплатформеная аутентификация:** Бесшовная авторизация через QR-код (сканирование из мобильного приложения), связывающая оффлайн-железо с цифровым профилем. \n- **Семиотический код UI:** Унификация визуального языка между Mobile App и Desktop Shell для снижения когнитивной нагрузки при переключении устройств.\n## Ключевые метрики\n- **Operational Efficiency:** Сокращение времени обслуживания одного клиента администратором (Time-to-Serve). \n- **Upsell Conversion:** Рост среднего чека за счет заказа товаров через внутренний магазин на ПК (Shop Module). \n- **Session Continuity:** Увеличение средней длительности сессии (благодаря бесшовному продлению).\n## Процесс работы\nРазработка велась в тесной связке с Софт-ограничениями (блокировка Windows, доступ к файловой системе).\n1. **Архитектура:** Спроектирована логика \"безопасного буфера\" (5 минут бесплатного времени), позволяющая пользователю настроить периферию до оплаты. Это снизило количество возвратов.\n2. **Межплатформеный синк:** Реализована синхронизация состояний в реальном времени. Если пользователь продлевает время в Мобильном приложении, Desktop Shell обновляется мгновенно без перезагрузки.\n3. **UI/UX Адаптация:** Адаптация паттернов e-commerce (корзина, каталог) под десктопное использование во время игры (Сворачиваемый интерфейс, чтобы не перекрывать игру).\n4. **Инструменты админа:** Спроектирован интерфейс для админа, где заказы из \"Зала\" (с ПК пользователей) падают в единый бэклог задач (Кухня/БАР).\n## Риск менеджмент\n- **Риск:** Пользователи не будут регистрироваться из-за сложности ввода данных на клавиатуре. Митигация: Внедрена регистрация в формате чат-бота (Conversational UI) и быстрый вход по QR без пароля. \n- **Риск:** \"Слепота\" к дополнительным услугам. Митигация: Внедрение ненавязчивых уведомлений и быстрый доступ к магазину (Quick Actions) прямо из оверлея.\n## Итоги\nСоздана замкнутая экосистема, где ПК является не просто инструментом игры, но и точкой продаж. \n- **Автоматизация:** Администраторы освобождены от рутины и сфокусированы на сервисе и разрешении инцидентов. \n- **Рост Revenue:** Внедрение магазина внутри ПК увеличило продажи бара (пользователи заказывают, не вставая). ",
    "date": "2026-01-14",
    "category": "design",
    "coverImage": "/images/cases/1768426629572-9wdjqp.png",
    "images": [
      "/images/cases/1768426843548-ucek38.png",
      "/images/cases/1768426843554-oi44j2.png",
      "/images/cases/1768426843537-vnr0l1.png",
      "/images/cases/1768426843553-wkw74q.png",
      "/images/cases/1768426843549-cy7q5u.png",
      "/images/cases/1768426843583-tmb0rr.png",
      "/images/cases/1768426843549-vh7tx6.png",
      "/images/cases/1768426843605-rw4sxk.png",
      "/images/cases/1768426843585-zn2kq7.png",
      "/images/cases/1768426843605-ashcjy.png",
      "/images/cases/1768426843584-24jnkv.png",
      "/images/cases/1768426843604-yc86u0.png",
      "/images/cases/1768426843686-5gk9kw.png",
      "/images/cases/1768426843665-4ogv6t.png",
      "/images/cases/1768426843738-gxroez.png"
    ],
    "galleryLayout": "stack",
    "componentUrl": "",
    "tags": [
      "ERP",
      "B2B"
    ],
    "content": "",
    "published": true,
    "featuredOnHome": true,
    "homeOrder": 4,
    "createdAt": "2026-01-14T21:37:31.316Z",
    "updatedAt": "2026-01-20T13:07:52.849Z",
    "title_en": "ERP for Game club",
    "description_en": "Product: THE HOOD OS (Desktop Shell + Admin Panel) | Role: Product Designer Goal: Operations automation and Service Upsell via desktop | Status: Release MVP\n## Problem\nThe classic cyber cafe model created a \"bottleneck\" at the Reception desk.\n1. **Operational Burden:** Administrators spent 80% of their time on manual time extensions and taking orders (food/drinks), creating queues.\n2. **Disconnected Experience:** Gamers had to leave their PCs to buy more time or food, interrupting their \"Flow\" and reducing revenue.\n3. **Complex Onboarding:** Low conversion to registration due to lengthy form filling at the register.\n## Goals\nTransforming a \"gaming computer\" into a \"self-service terminal.\"\n- **Self-Service Experience:** Shifting 90% of operations (extensions, food purchases, calling for help) inside the client interface on the PC.\n- **Cross-Platform Auth:** Seamless authorization via QR code (scanning from the mobile app), linking offline hardware with the digital profile.\n- **Omnichannel UI:** Unifying the visual language between the Mobile App and Desktop Shell to reduce cognitive load when switching devices.\n## Key Metrics\n- **Operational Efficiency:** Reduction in administrator Time-to-Serve per client.\n- **Upsell Conversion:** Growth in Average Order Value (AOV) via the internal PC store (Shop Module).\n- **Session Continuity:** Increase in average session duration (thanks to seamless time extension).\n## Work Process\nDevelopment was conducted in close coordination with Hardware constraints (Windows lockdown, file system access).\n1. **Architecture:** Designed a \"safe buffer\" logic (5 minutes of free time), allowing users to configure peripherals before paying. This reduced refund requests.\n2. **Ecosystem Sync:** Implemented real-time state synchronization. If a user extends time in the Mobile App, the Desktop Shell updates instantly without a reboot.\n3. **UI/UX Adaptation:** Adaptation of e-commerce patterns (cart, catalog) for desktop usage during gaming (minimap-friendly interface to avoid covering the game).\n4. **Admin Tools:** Designed an admin interface where orders from the \"Floor\" (from user PCs) land in a unified task backlog (Kitchen/Bar Management).\n## Risk Management\n- **Risk:** Users won't register due to the difficulty of typing on a keyboard. Mitigation: Implemented registration in a chatbot format (Conversational UI) and quick QR login without a password.\n- **Risk:** \"Blindness\" to additional services. Mitigation: Implementation of non-intrusive notifications and quick access to the store (Quick Actions) directly from the overlay.\n## Outcomes\nCreated a self-contained ecosystem where the PC is not just a gaming tool, but a point of sale.\n- **Automation:** Administrators are freed from routine tasks and focused on service and incident resolution.\n- **Revenue Growth:** Implementing the in-PC store increased bar sales (users order without getting up)."
  }
]